### __Soal 2 - Kerja Kerja Kerja__
Disediakan sebuah dataset yang berisi daftar profesi beberapa responder, unduh: profesi.csv. Buatlah sebuah file python (.py) atau notebook (.ipynb) yang dapat menyelesaikan perintah berikut.

#### __1. Ada berapa jenis profesi yang ada dalam dataset tersebut? Sebutkan!__

In [1]:
# Importing pandas package
import pandas as pd

In [2]:
# Reading CSV file
df = pd.read_csv('profesi.csv', delimiter='|')
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [3]:
# Jumlah profesi yang ada
len(df['occupation'].unique())

21

In [4]:
# Daftar 21 profesi yang ada
print(df['occupation'].unique())

['technician' 'other' 'writer' 'executive' 'administrator' 'student'
 'lawyer' 'educator' 'scientist' 'entertainment' 'programmer' 'librarian'
 'homemaker' 'artist' 'engineer' 'marketing' 'none' 'healthcare' 'retired'
 'salesman' 'doctor']

#### __2. Buatlah sebuah dataframe yang menunjukkan data usia maksimal, minimal & rata-ratanya, kemudian dikelompokkan berdasarkan profesi & gender!__

In [5]:
# Grouping data berdasarkan occupation => gender, kemudian menampilkan describe()
dfg = df.groupby(['occupation','gender']).describe()

# Menampilkan hanya kolom age, sub-column => max, min, dan mean
dfg = dfg['age'][['max','min','mean']]

# Merubah type object max & min dari float menjadi int
dfg['max'] = dfg['max'].astype('int')
dfg['min'] = dfg['min'].astype('int')

# Mengganti nama kolom sesuai instruksi di soal
dfg.rename(columns={'max':'max_usia', 'min':'min_usia', 'mean':'rerata_usia'}, inplace=True)
dfg.head()

                      max_usia  min_usia  rerata_usia
occupation    gender
administrator F             62        22    40.638889
              M             70        21    37.162791
artist        F             48        19    30.307692
              M             45        20    32.333333
doctor        M             64        28    43.571429

#### __3. Buatlah sebuah dataframe yang menunjukkan persentase pria & wanita tiap profesi!__

In [6]:
# Melakukan crosstab untuk menampilkan relasi kolom occupation dan gender
# Karena data yang ditampilkan berupa persentase, sehingga digunakan apply()
dfc = pd.crosstab(df['occupation'], df['gender']).apply(lambda i: i/i.sum()*100, axis=1)

# Merubah urutan kolom dari F, M => M, F
dfc = dfc[['M','F']]

# Menambah kolom baru yang value nya berupa jumlah dari kolom M dan F
dfc['%total'] = dfc['M'] + dfc['F']

# Mengganti nama kolom sesuai instruksi pada soal
dfc.rename(columns={'M':'%male', 'F':'%female'}, inplace=True)
dfc.head()

gender              %male    %female  %total
occupation
administrator   54.430380  45.569620   100.0
artist          53.571429  46.428571   100.0
doctor         100.000000   0.000000   100.0
educator        72.631579  27.368421   100.0
engineer        97.014925   2.985075   100.0